Revit 2027 API
NumberingSchema.Create Method
 Creates a numbering schema and registers it with a document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static NumberingSchema Create(
	Document aDoc,
	string schemaName,
	ElementId numberingParameterId,
	ElementId filterId,
	int priority
)
Public Shared Function Create (
	aDoc As Document,
	schemaName As String,
	numberingParameterId As ElementId,
	filterId As ElementId,
	priority As Integer
) As NumberingSchema
public:
static NumberingSchema^ Create(
	Document^ aDoc,
	String^ schemaName,
	ElementId^ numberingParameterId,
	ElementId^ filterId,
	int priority
)
static member Create :
        aDoc : Document *
        schemaName : string *
        numberingParameterId : ElementId *
        filterId : ElementId *
        priority : int -> NumberingSchema
Parameters
aDoc Document
 The target docment where this schema will be created.
schemaName String
 Name of the schema.
numberingParameterId ElementId
 The id of the parameter that represents the number of the numbered element.
filterId ElementId
 The filter used to determine the scope for this numbering schema, if one is provided, scopeCategories are ignored
priority Int32
 The priority of the schema
Return Value
NumberingSchema
 Return schema which has not been added to a document or registered with a numbering tracker. If schema was not created, an exception is raised.
Exceptions
Exception | Condition
ArgumentException |  The given schemaName has is invalid or allready in use. -or- The input schemaName already exists in the target document. -or- The given numberingParameterId is not compatible with the filterId provided for this numbering schema.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace